## 웹서비스

- ex) 트위터, 구글, 인스타그램
- 하나의 큰 뿌리를 공유: 우리는 웹 서비스로부터 원하는 것을 얻는다.
- ex) 구글에 멋쟁이사자처럼 검색

    요청(request): 우리(클라이언트, client)——구글아 멋쟁이사자처럼에 대한 정보 좀 줄래?——→구글(서버, server)

- 응답(response): 우리(식당 손님) ←————받아————————구글 (서빙 직원)
- 웹 서비스를 만든다 = 서버로서 작동할 수 있는 프로그램을 만든다.

## Request의 종류

1. 갖다줘 = GET (친구사진 보여줘)
2. 처리해 줘 = POST (내 사진 올려줘, 처리해줘)

-뭘 갖다주고 처리해? ⇒ HTML 파일 (다른 파일도 있음)

-나는 네이버를 켜고 웹툰을 본 다음 재미있다고 댓글을 달았다.

⇒ GET(네이버 갖다줘), GET(서버야 웹툰 갖다줘), POST(내 댓글좀 처리해(달아)줘)

- P2P(Peer - To- Peer)

:친구에서 친구로, 모두가 서버이자 모두가 클라이언트

## WWW

- World Wide Web, 세상 넓은 거미줄 = 인터넷

## 웹 브라우저

- 서버와 연결해주는 통로ex)인터넷익스플로러, 크롬, 파이어폭스
- HTML 파일을 웹 서비스로부터 받아주고, 내 컴퓨터에 있는 HTML을 열어주고, 내 컴퓨터에 있는 HTML파일을 웹 서비스로 보내줌

## Review

1. client - server (↔ P2P)
2. Request - Response
3. 그 때 오가는 문서 HTML
4. WWW와 인터넷
5. 웹 브라우저