## 서버컴퓨터

- 신경써야할 부분만 확실히 신경 쓴 컴퓨터
1. 빠른 컴퓨팅 능력(빠른 연산 속도)
2. 24시간 무한루프
3. 발열 냉각장치
4. 클라이언트 수 고려
5. 보안 중요

## 서버가 되기 위한 두가지 방법

1. 내 컴퓨터를 서버 컴퓨터화시키기(웹 서버를 직접 설치한다, 로컬 환경을 세팅한다.)

    ex)Apache(아파치), Microsoft IIS

    1. 설치 다소 까다로움
    2. 추가적인 지식 요구
    3. 한 번 익히면 자유로운 개발 가능

2. 이 세상 어딘가의 서버컴퓨터 빌리기(웹호스팅 업체 빌리기)

    ex) AWS Cloud9, GitHub

    1. 설치와 조작이 단순
    2. 과금 발생
    3. 개발에 있어 제약이 있음(인터넷으로 서버를 양도받기때문에 인터넷연결필수)
    4. 클라이언트 수를 고려하지 않아도  됨

## Review

1. About 서버 컴퓨터
    1. 빠른 컴퓨팅 능력(빠른 연산 속도)
    2. 24시간 무한루프
    3. 발열 냉각장치
    4. 클라이언트 수 고려
    5. 보안 중요

2. 서버 프로그램을 만드는 두 가지 방법

    1.내 컴퓨터를 서버컴퓨터화 시키기(로컬환경세팅) ex)아파치,IIS, 장단점 O

    2. 이 세상 어딘가의 서버 컴퓨터 인터넷으로 빌리기(웹호스팅) ex) Github, AWS c9,장단점O